src/cf/DataProcessors/кзоВыгрузкаЗагрузкаПравил.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>кзоВыгрузкаЗагрузкаПравил</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьНеАктивными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Правила</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кзоПравилаПроверкиЗаполнения</v8:Type>
								<v8:Type>cfg:CatalogRef.кзоПравилаЗаполнения</v8:Type>
								<v8:Type>cfg:CatalogRef.кзоСобытияЭлементовФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/кзоПравилаЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>кзоПравилаЗаполнения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаОтбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПрограммныйКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кзоВидыСобытийПравилЗаполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриКопировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриЗаполнении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПриНажатииНаКнопку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заполнение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СобытияЭлементовФорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СобытиеЭлементаФормы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кзоСобытияЭлементовФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/кзоВыгрузкаЗагрузкаПравил/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает все активные ПравилаЗаполнения, ПравилаПроверкиЗаполнения
// 
// Возвращаемое значение:
//  Массив - Массив ссылок Справочник.кзоПравилаЗаполнения, Справочник.кзоПравилаПроверкиЗаполнения
//
Функция ПолучитьВсеПравила() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаЗаполнения.Ссылка КАК Правило
		|ИЗ
		|	Справочник.кзоПравилаЗаполнения КАК ПравилаЗаполнения
		|ГДЕ
		|	ПравилаЗаполнения.Активно
		|	И НЕ ПравилаЗаполнения.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПравилаПроверкиЗаполнения.Ссылка
		|ИЗ
		|	Справочник.кзоПравилаПроверкиЗаполнения КАК ПравилаПроверкиЗаполнения
		|ГДЕ
		|	ПравилаПроверкиЗаполнения.Активно
		|	И НЕ ПравилаПроверкиЗаполнения.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Правило");
		
КонецФункции

// Выгружает массив ссылок в двоичные данные для сохранения в файл
//
// Параметры:
//  МассивСсылок - Массив	 - Массив ссылок Справочник.кзоПравилаЗаполнения, Справочник.кзоПравилаПроверкиЗаполнения
// 
// Возвращаемое значение:
//  ДвоичныеДанные - Данные для сохранения в файл методом ДвоичныеДанные.Записать(ИмяФайла)
//
Функция ВыгрузитьВДвоичныеДанные(МассивСсылок) Экспорт
	
	Поток = Новый ПотокВПамяти;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьПоток(Поток);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("ПравилаЗаполнения");
	
	Для каждого Ссылка Из МассивСсылок Цикл
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Ссылка.ПолучитьОбъект(), НазначениеТипаXML.Явное);
		
		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.кзоПравилаЗаполнения") Тогда			
			Для каждого Событие Из Ссылка.СобытияЭлементовФорм Цикл
				СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Событие.СобытиеЭлементаФормы.ПолучитьОбъект(), НазначениеТипаXML.Явное);		
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть();
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Загружает правила из двоичных данных и возвращает массив ссылок загруженных правил
//
// Параметры:
//  ДвоичныеДанные		 - ДвоичныеДанные	 - Двоичные данные файла с правилами, например ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла)
//  ЗагружатьНеАктивными - Булево			 - Загружает правила и деактивирует их. Значение по-умолчанию: Ложь
// 
// Возвращаемое значение:
//  Массив - Массив ссылок загруженных правил Справочник.кзоПравилаЗаполнения, Справочник.кзоПравилаПроверкиЗаполнения
//
Функция ЗагрузитьИзДвоичныхДанных(ДвоичныеДанные, ЗагружатьНеАктивными = Ложь) Экспорт
	
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения(); 
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьПоток(Поток);
	ЧтениеXML.Прочитать();
	
	Если ЧтениеXML.Имя <> "ПравилаЗаполнения" Тогда
		ВызватьИсключение "Не корректный файл";	
	КонецЕсли;
	
	МассивСсылок = Новый Массив;
	
	ЧтениеXML.Прочитать();
	Пока ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		
		Если ЧтениеXML.Имя = "CatalogObject.кзоПравилаЗаполнения" 
			ИЛИ ЧтениеXML.Имя = "CatalogObject.кзоПравилаПроверкиЗаполнения"
			Тогда
			СправочникОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			Если ЗагружатьНеАктивными Тогда
				СправочникОбъект.Активно = Ложь;
			КонецЕсли;
			
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			
		ИначеЕсли ЧтениеXML.Имя = "CatalogObject.кзоСобытияЭлементовФорм" Тогда
			СправочникОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			
		КонецЕсли;
		
		МассивСсылок.Добавить(СправочникОбъект.Ссылка);
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	Возврат МассивСсылок;
	
КонецФункции

#КонецОбласти
